Conf.Simple/src/InformationRegisters/SUI_ЗапросыКодовМаркировки/SUI_ЗапросыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ЗапросыКодовМаркировки</name>
  <resources>
    <name>ДанныеДляЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФоновогоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_РезультатыЗапросовКодовМаркировки/SUI_РезультатыЗапросовКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_РезультатыЗапросовКодовМаркировки</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonModules/SUI_ЗапросыКодовМаркировки/Module.bsl
#Область ПрограммныйИнтерфейс

// Создать запрос.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
//  Штрихкоды - Массив из Строка - Штрихкоды к запросу
// 
// Возвращаемое значение:
//  Строка - Идентификатор запроса
Функция СоздатьЗапрос(МобильноеУстройство, Штрихкоды) Экспорт
	
	ИдентификаторЗапроса = СформироватьИдентификаторЗапроса(МобильноеУстройство);
	
	Запись = РегистрыСведений.SUI_ЗапросыКодовМаркировки.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторЗапроса = ИдентификаторЗапроса;
	Запись.МобильноеУстройство = МобильноеУстройство;
	Запись.ДанныеДляЗапроса = Новый ХранилищеЗначения(Штрихкоды, Новый СжатиеДанных(9));
	
	УстановитьПривилегированныйРежим(Истина);
	ЗапущенноеЗадание = ЗапуститьВыполнениеЗапросаВФоне(ИдентификаторЗапроса, МобильноеУстройство, Штрихкоды);
	Запись.ИдентификаторФоновогоЗадания = ЗапущенноеЗадание.УникальныйИдентификатор;
	УстановитьПривилегированныйРежим(Ложь);
	
	Запись.ДатаЗаписи = ТекущаяДатаСеанса();
	Запись.Записать(Истина);
	
	Возврат ИдентификаторЗапроса;
	
КонецФункции

// Получить результат запроса.
// 
// Параметры:
//  ИдентификаторЗапроса - Строка - Идентификатор запроса
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
// 
// Возвращаемое значение:
//  Структура - Получить результат запроса:
// * ЗаданиеВыполняется - Булево - Признак активного задания запроса
// * ТекстОшибки - Строка - Текст ошибки выполнения задания запроса
// * Данные - Произвольный - Результат выполения задания запроса
Функция ПолучитьРезультатЗапроса(ИдентификаторЗапроса, МобильноеУстройство) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ЗаданиеВыполняется", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Данные");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗапросыКодовМаркировки.ИдентификаторФоновогоЗадания,
		|	ЗапросыКодовМаркировки.ДанныеДляЗапроса,
		|	ЕСТЬNULL(РезультатыЗапросовКодовМаркировки.Результат, НЕОПРЕДЕЛЕНО) КАК Результат
		|ИЗ
		|	РегистрСведений.SUI_ЗапросыКодовМаркировки КАК ЗапросыКодовМаркировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_РезультатыЗапросовКодовМаркировки КАК РезультатыЗапросовКодовМаркировки
		|		ПО ЗапросыКодовМаркировки.ИдентификаторЗапроса = РезультатыЗапросовКодовМаркировки.ИдентификаторЗапроса
		|		И ЗапросыКодовМаркировки.МобильноеУстройство = РезультатыЗапросовКодовМаркировки.МобильноеУстройство
		|ГДЕ
		|	ЗапросыКодовМаркировки.ИдентификаторЗапроса = &ИдентификаторЗапроса
		|	И ЗапросыКодовМаркировки.МобильноеУстройство = &МобильноеУстройство";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", ИдентификаторЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Запрос не найден!'");
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Результат <> Неопределено Тогда
			Результат.Данные = Выборка.Результат.Получить();
		Иначе
			
			УстановитьПривилегированныйРежим(Истина);
			
			Задание = Неопределено;
			
			Если ЗначениеЗаполнено(Выборка.ИдентификаторФоновогоЗадания) Тогда
				Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторФоновогоЗадания);
			КонецЕсли;
			
			Если Задание = Неопределено Тогда
				Штрихкоды = Выборка.ДанныеДляЗапроса.Получить();
				Задание = ЗапуститьВыполнениеЗапросаВФоне(ИдентификаторЗапроса, МобильноеУстройство, Штрихкоды);
			КонецЕсли;
			
			Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				
				ЕстьЗаписьРезультата = Ложь;
				РезультатЗапроса = Запрос.Выполнить();
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					
					Если Выборка.Результат <> Неопределено Тогда
						ЕстьЗаписьРезультата = Истина;
						Результат.Данные = Выборка.Результат.Получить();
					КонецЕсли;
					
				КонецЕсли;
				
				Если Не ЕстьЗаписьРезультата Тогда
					Результат.ТекстОшибки = НСтр("ru = 'Не удалось получить результат выполнения запроса кодов маркировки!'");
				КонецЕсли;
				
			ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
			ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
				Результат.ТекстОшибки = НСтр("ru = 'Задание запроса кодов маркировки было отменено!'");
			Иначе
				Результат.ЗаданиеВыполняется = Истина;
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удалить запрос.
// 
// Параметры:
//  ИдентификаторЗапроса - Строка - Идентификатор запроса
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
Процедура УдалитьЗапрос(ИдентификаторЗапроса, МобильноеУстройство) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запись = РегистрыСведений.SUI_ЗапросыКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторЗапроса = ИдентификаторЗапроса;
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			ИдентификаторФоновогоЗадания = Запись.ИдентификаторФоновогоЗадания;
			Запись.Удалить();
		КонецЕсли;
		
		Запись = РегистрыСведений.SUI_РезультатыЗапросовКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторЗапроса = ИдентификаторЗапроса;
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.Удалить();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , , ИдентификаторЗапроса, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторФоновогоЗадания);
	
	АктивныеЗадания = НайтиФоновыеЗаданияПоИндентификаторуЗапроса(ИдентификаторЗапроса);
	Для индекс = 0 По АктивныеЗадания.ВГраница() Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(АктивныеЗадания[индекс].УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗаданиеЗапросКодовМаркировки(Параметры, АдресРезультата = "") Экспорт
	
	ОжидаемыеТипыСвойств = Новый Структура();
	ОжидаемыеТипыСвойств.Вставить("ИдентификаторЗапроса", Тип("Строка"));
	ОжидаемыеТипыСвойств.Вставить("МобильноеУстройство", Тип("ПланОбменаСсылка.SUI_МобильныеУстройства"));
	ОжидаемыеТипыСвойств.Вставить("Штрихкоды", Тип("Массив"));
	
	ИдентификаторЗапроса = Неопределено;
	
	Попытка
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			"РегистрыСведений.SUI_ЗапросыКодовМаркировки.ВыполнитьЗаданиеЗапросКодовМаркировки", 
			"Параметры", Параметры, Тип("Структура"), ОжидаемыеТипыСвойств);
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(Параметры.ИдентификаторЗапроса),
			НСтр("ru = 'Пустой идентификатор запроса'"));
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не Параметры.МобильноеУстройство.Пустая(),
			НСтр("ru = 'Пустая ссылка мобильного устройства'"));
		
		ИдентификаторЗапроса = Параметры.ИдентификаторЗапроса;
		
		РезультатВыполнения = SUI_ИнтеграцияГИСМТ.ВыполнитьЗапросСоставаКодовМаркировки(Параметры.Штрихкоды);
		
		Запись = РегистрыСведений.SUI_РезультатыЗапросовКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторЗапроса = ИдентификаторЗапроса;
		Запись.МобильноеУстройство = Параметры.МобильноеУстройство;
		Запись.Результат = Новый ХранилищеЗначения(РезультатВыполнения, Новый СжатиеДанных(9));		
		Запись.ДатаЗаписи = ТекущаяДатаСеанса();
		Запись.Записать(Истина);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , , ИдентификаторЗапроса, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия()
	
	Возврат НСтр("ru = 'Запрос кодов маркирвоки'");
	
КонецФункции

Функция СформироватьИдентификаторЗапроса(МобильноеУстройство)
	
	ДанныеИдентификатора = Новый Массив();
	ДанныеИдентификатора.Добавить("SimpleЗапросКодовМаркировки");
	ДанныеИдентификатора.Добавить(МобильноеУстройство);
	ДанныеИдентификатора.Добавить(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	ИдентификаторЗапроса = SUI_ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеИдентификатора, ХешФункция.SHA1);
	
	Возврат НРег(ИдентификаторЗапроса);
	
КонецФункции

Функция ИмяМетодаОбработчика()
	
	Возврат "SUI_ЗапросыКодовМаркировки.ВыполнитьЗаданиеЗапросКодовМаркировки";
	
КонецФункции

Функция НайтиФоновыеЗаданияПоИндентификаторуЗапроса(ИдентификаторЗапроса, ТолькоАктивные = Истина)
	
	ОтборФоновыхЗаданий = Новый Структура();
	ОтборФоновыхЗаданий.Вставить("ИмяМетода", ИмяМетодаОбработчика());
	ОтборФоновыхЗаданий.Вставить("Ключ", ИдентификаторЗапроса);
	
	Если ТолькоАктивные Тогда
		ОтборФоновыхЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	КонецЕсли;
	
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФоновыхЗаданий);
	
	Возврат Задания;
	
КонецФункции

Функция ЗапуститьВыполнениеЗапросаВФоне(ИдентификаторЗапроса, МобильноеУстройство, Штрихкоды)
	
	ЗапущенныеЗадания = НайтиФоновыеЗаданияПоИндентификаторуЗапроса(ИдентификаторЗапроса);
	
	Если ЗапущенныеЗадания.Количество() = 0 Тогда
		
		ПараметрОбработчика = Новый Структура();
		ПараметрОбработчика.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
		ПараметрОбработчика.Вставить("МобильноеУстройство", МобильноеУстройство);
		ПараметрОбработчика.Вставить("Штрихкоды", Штрихкоды);
		
		ПараметрыОбработчика = Новый Массив();
		ПараметрыОбработчика.Добавить(ПараметрОбработчика);
		
		НаименованиеЗадания = НСтр("ru = 'Simple: Запрос кодов маркировки (%1)'");
		НаименованиеЗадания = СтрШаблон(НаименованиеЗадания, ИдентификаторЗапроса);
		
		Задание = ФоновыеЗадания.Выполнить(ИмяМетодаОбработчика(), ПараметрыОбработчика, ИдентификаторЗапроса, НаименованиеЗадания);
		
	Иначе
		Задание = ЗапущенныеЗадания[0].УникальныйИдентификатор;
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

#КонецОбласти
